<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      <key>PayloadContent</key>
      <array>
	      <dict>
		      <!-------------------------------------------------------------------------------------------------------------->
		      <!-- Profile metadata. Typically you'll need to set only a random UUID for PayloadIdentifier and PayloadUUID. -->
		      <!-------------------------------------------------------------------------------------------------------------->

		      <!-- The name displayed in System Settings when this profile is installed. -->
		      <key>PayloadDisplayName</key>
		      <string>Firezone</string>

		      <!-- The bundle ID of the Firezone Client followed by a random, unique UUID for this profile. -->
		      <key>PayloadIdentifier</key>
		      <string>dev.firezone.firezone.99F6A301-65E3-4AB7-B226-6978530050CE</string>

		      <!-- The type of payload, which is a Firezone-specific payload type. -->
		      <key>PayloadType</key>
		      <string>dev.firezone.firezone</string>

		      <!-- A unique identifier for this payload, which can be any UUID. Should match what's in PayloadIdentifier. -->
		      <key>PayloadUUID</key>
		      <string>99F6A301-65E3-4AB7-B226-6978530050CE</string>

		      <!-- The version of the payload. -->
		      <key>PayloadVersion</key>
		      <integer>1</integer>

		      <!----------------------------------------->
		      <!-- Firezone configuration begins here. -->
		      <!----------------------------------------->

		      <!-- The account slug or ID of your Firezone account. -->
		      <key>accountSlug</key>
		      <string>acme_corp</string>

		      <!-- The WebSocket URL of the Firezone control plane. -->
		      <key>apiURL</key>
		      <string>wss://api.firezone.dev</string>

		      <!-- The base auth URL of the Firezone application to sign in to. -->
		      <key>authURL</key>
		      <string>https://app.firezone.dev</string>

		      <!-- Whether the client should start automatically on login. -->
		      <key>connectOnStart</key>
		      <true/>

		      <!-- Whether the client should connect automatically on start. -->
		      <key>disableUpdateCheck</key>
		      <true/>

		      <!-- Whether to disable the periodic update checker. -->
		      <key>hideAdminPortalMenuItem</key>
		      <true/>

		      <!-- Whether to show or hide the admin portal link in the main menu. -->
		      <key>logFilter</key>
		      <string>info</string>

		      <!-- The RUST_LOG-formatted log filter to apply to the connectivity library logger. -->
		      <key>startOnLogin</key>
		      <true/>

		      <!-- Whether the client should start automatically on login. -->
		      <key>supportURL</key>
		      <string>https://www.firezone.dev/support</string>
	      </dict>
      </array>

       <!-- Don't change these keys. -->
      <key>PayloadDisplayName</key>
      <string>Untitled</string>
      <key>PayloadIdentifier</key>
      <string>Airbook-Mac.0DD8420F-14E4-4B15-AECD-6386B9324EEC</string>
      <key>PayloadType</key>
      <string>Configuration</string>
      <key>PayloadUUID</key>
      <string>0DD8420F-14E4-4B15-AECD-6386B9324EEC</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
</dict>
</plist>
